#include "Header.h"

void Count(){
  scanf("%d",&Page); // 페이지 입력
  tmp = Page; // 임시 저장
  ten = 1; // 초기화
  while(tmp){
    digit = (Page%(ten*10))/ten; // 입력받은 수의 각 자릿수 추출
    quot =  Page/(ten*10); // digit 자릿수보다 큰 수 남기기
    remind = Page%ten; // digit 자릿수보다 작은 수 남기기

    for(int i=0;i<10;i++) arr[i]+=(quot*ten); 
    // ex) '42'3 -> 1의 자리에서 0~9는 42*1번 등장 (4 : '00'4, '01'4, '02'4, '03'4, .... , '41'4)
    //     '4'23 -> 10의 자리에서 0~9는 4*10번 등장 (1 : '0'1X, '1'1X, '2'1X, '3'1X) : X는 0~9까지
    //      423 -> 100의 자리에서 0~9는 0*100번 등장 ()

    for(int i=0;i<digit;i++) arr[i]+=ten; 
    // ex)  '42'3 -> 1의 자리에서 0~digit-1은 1번 등장 (420, 421, 422)
    //      '4'23 -> 10의 자리에서 0~digit-1은 10번 등장 (40X,41X) : X는 0~9까지 
    //      423 -> 100의 자리에서 0~digit-1은 100번 등장 (0XX, 1XX, 2XX, 3XX) : XX는 0~99까지 

    arr[digit]+=(remind+1); 
    // ex)  42'3' -> 1의 자리에서 digit은 1번 등장 (42'3')
    //      4'2'3 -> 10의 자리에서 digit은 4번 등장 (4'2'0, 4'2'1, 4'2'2, 4'2'3) 
    //      '4'23 -> 100의 자리에서 digit은 24번 등장 ('4'00, '4'01, .... , '4'23)

    arr[0]-=ten; // 있으면 안되는 0이 포함된 수 개수 제거 (ex: 001, 045 등)

    ten*=10; // 10의 거듭제곱
    tmp/=10; // 남은 수 표시
  }
}